#+TITLE: Offer Template
#+AUTHOR: Shair.Tech
#+DATE: <2021-11-22 Sat>
#+SUBTITLE: Offer Subtitle
#+DESCRIPTION: Brief description of the document
#+KEYWORDS: keyword1, keyword2, ...

#+STARTUP: overview
#+PRIORITIES: A D D
#+OPTIONS: d:t
#+OPTIONS: ':t
#+OPTIONS: num:t
#+OPTIONS: toc:nil
#+OPTIONS: todo:nil
#+OPTIONS: pri:nil
#+TODO: NEW TODO DOING FEEDBACK | DONE CANCELED STANDBY
#+COLUMNS: %30Item %10SCHEDULED %10DEADLINE %Effort_Working_Hours{+} %Cost{+;%.2f} %Total{+;%.2f}


#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,11pt]

#+LATEX_HEADER: \usepackage[in,headings]{fullpage}
#+LATEX_HEADER: \usepackage[graphicx]{realboxes}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: %% \usepackage[italian]{babel}

#+LATEX_HEADER: \setlength\parindent{0pt}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \fancyhead[R]{YOUR R-HEADER HERE}
#+LATEX_HEADER: \fancyhead[L]{YOUR L-HEADER HERE}
#+LATEX_HEADER: \renewcommand{\headrulewidth}{0.1mm}
#+LATEX_HEADER: \pagestyle{plain}

#+LATEX_HEADER: %% \pagestyle{myheadings}
#+LATEX_HEADER: %% \def \@evenhead {\thepage \hfil \slshape \leftmark }#+LATEX_HEADER: %% \def \@oddhead {{\slshape \rightmark }\hfil \thepage }
#+LATEX_HEADER: %% \usepackage{fontspec}
#+LATEX_HEADER: %% \setmainfont{FreeSerif}
#+LATEX_HEADER: \newenvironment{remark}{\textbf{Remark}\begin{itshape}}{\end{itshape}}

#+BEAMER_HEADER: \usetheme[numbering=fraction]{metropolis}
#+ODT_STYLES_FILE: "org-proposal-template.odt"

#+BEGIN_SRC emacs-lisp :exports none :results none
  ;; alist of team members names and rates
  (setq hourly-rates
        '((adolfo  . 10.00)
          (michele . 20.00)))

  ;; you can explicitly set the overhead and the profit here, as a
  ;; percentage on top of the total amount computed for the task.
  (setq overhead 0.20)
  (setq profit   0.0)

  ;; if we are estimating without explicitly allocating people, budget
  ;; estimations will be computed using an average rage; the data below
* Budget

  Budget rows have to be inserted by hand.  VAT and Total are computed.  In
  our experience the data computed from todos need some adjustments/grouping
  to make it into the budget.

  You can use the previous (Budget by Item) or the last section (Budget
  Detailed Data) of this document to get summary data and put it in the
  budget.
  
  #+NAME: budget_table
  | ! | Cost Item          |     Cost |
  |---+--------------------+----------|
  |   | Group 1            |    10500 |
  |---+--------------------+----------|
  |   | Total (Before VAT) | 10500.00 |
  |---+--------------------+----------|
  |   | VAT                |  2310.00 |
  |   | Total (with VAT)   | 12810.00 |
  |---+--------------------+----------|
  #+TBLFM: @>>>$3 =vsum(@2..@>>>>);%.2f
  #+TBLFM: @>>$3 = 0.22 * @-1;%.2f
  #+TBLFM: @>$3 = @-1 + @-2;%.2f

* Payments Structure

  Set the first two columns of this table and the other columns will
  be computed for you.

  #+NAME: payments_structure
  | Date       | Amount |     Net |     VAT | Payment |
  |------------+--------+---------+---------+---------|
  | 01/03/2022 |    50% | 5250.00 | 1155.00 | 6405.00 |
  | 21/06/2022 |    10% | 1050.00 |  231.00 | 1281.00 |
  | 21/11/2022 |    40% | 4200.00 |  924.00 | 5124.00 |
  |------------+--------+---------+---------+---------|
  #+TBLFM: $3 = $2 * remote(budget_table, remote(budget_table, @>>>$3) ; %.2f
  #+TBLFM: $4 = 0.22 * $3 ; %.2f
  #+TBLFM: $5 = $3 + $4 ; %.2f

* Integrating with h-ledger                                        :noexport:

This section generates the plain-text accounting data we use with hledger.
Project accounting is structure as follows:

- The project budget is split in equal parts for the duration of the project
- Each month we transfer from =revenues= to =accrued_work=
- When we get paid, we move from =accrued_work= to the =bank= account and we
  account for VAT

This works on the assumption that the project is paid for with a flat fee.  If
you are charging by time and expense, the data below should become the project
budget and the valorization should be computed on the actual hours worked.

#+begin_src emacs-lisp :var data = project_data :var table = payments_structure :results output :wrap CODE
  (setq project-name    (nth 1 (nth 0 data)))
  (setq project-acronym (nth 1 (nth 1 data)))
  (setq start-date      (nth 1 (nth 2 data)))
  (setq months          (nth 1 (nth 3 data)))

  ;; computed from the table, sum of net values
  (setq amount (apply '+ (mapcar (lambda (x) (nth 2 x)) (cdr table))))

  (defun avm/build-date (string)
    (mapcar 'string-to-number
            (list (substring string 0 4) (substring string 5 7) (substring string 8 10))))

  (defun avm/emit-date (date)
    (format "%4d-%02d-%02d" (nth 0 date) (nth 1 date) (nth 2 date)))

  (defun avm/add-one-month (date)
    (let ( (year (car date))
           (month (cadr date))
           (day (caddr date)) )
      (let ( (new-month (+ month 1)) )
        (if (> new-month 12)
            (list (+ year 1) 1 day)
          (list year new-month day)))))

  (defun avm/emit-accrued-work-entry (date project acronym amount)
    (format "%s ! %s\n  %s\n  %-30s %10.2f\n  %-30s\n\n"
            date
            project
            (concat "; project:" project-acronym)
            "accrued_work"
            amount
            (concat "revenues:" (downcase project-acronym))))

  (defun avm/emit-project (date project acronym total-amount months)
    (let* ( (date (avm/build-date date))
            (amount (/ total-amount months))
            (remainder (- total-amount (* amount months))) )
      (avm/emit-project-ll date project acronym amount remainder months)))

  (defun avm/emit-project-ll (date project acronym amount remainder months)
    (if (> months 1)
        (concat
         (avm/emit-accrued-work-entry (avm/emit-date date) project acronym amount)
         (avm/emit-project-ll (avm/add-one-month date) project acronym amount remainder (- months 1)))
      (avm/emit-accrued-work-entry (avm/emit-date date) project acronym (+ amount remainder))))

  (defun avm/invert-date (date)
    (concat (substring date 6 10) "-" (substring date 3 5) "-" (substring date 0 2)))

  (defun avm/print-ledger-entry (row)
    (let ( (date  (nth 0 row)) 
           (net   (nth 2 row))
           (vat   (nth 3 row))
           (gross (nth 4 row)) )
      (format
       "%s ! %s\n  %s\n  %-30s %10.2f\n  %-30s %10.2f\n  %-30s %10.2f\n\n"
       (avm/invert-date date)
       project-name
       (concat "; project:" project-acronym)
       "bank"
       gross
       "credits:vat"
       (* -1 vat)
       (concat "accrued_work:" (downcase project-acronym))
       (* -1 net))))

  ;; this emits the accrued work
  (princ (avm/emit-project start-date project-name project-acronym amount months))

  ;; this emits the payments
  (mapcar 'princ (mapcar 'avm/print-ledger-entry (cdr table)))
#+end_src

#+RESULTS:
#+begin_CODE
2022-01-01 ! My Fancy Project name
  ; project:project-1
  accrued_work                      5250.00
  revenues:project-1            

2022-02-01 ! My Fancy Project name
  ; project:project-1
  accrued_work                      5250.00
  revenues:project-1            

2022-03-01 ! My Fancy Project name
  ; project:project-1
  bank                              6405.00
  credits:vat                      -1155.00
  accrued_work:project-1           -5250.00

2022-06-21 ! My Fancy Project name
  ; project:project-1
  bank                              1281.00
  credits:vat                       -231.00
  accrued_work:project-1           -1050.00

2022-11-21 ! My Fancy Project name
  ; project:project-1
  bank                              5124.00
  credits:vat                       -924.00
  accrued_work:project-1           -4200.00

#+end_CODE

*** Budget by priority

 Independent of the functional group.

 #+BEGIN_SRC emacs-lisp :exports results :results value table
   (mapcar
    (lambda (priority) 
      (list priority
            (format "EUR %8.2f"
                    (apply '+
                           (org-map-entries  
                            (lambda () 
                              (if (equal (avm/org-get-property-value "PRIORITY") priority)
                                  (av/org-get-property-value-as-number "COST")
                                0.00))
                            nil 'file)))))
    '("A" "B" "C"))
 #+end_src

 #+RESULTS:
 | A | EUR     0.00 |
 | B | EUR     0.00 |
 | C | EUR     0.00 |

